
## Backend Infra Plan Result

[CI link](https://github.com/na2na-p/sns-app/actions/runs/3994494174)


<pre><code>Plan: 12 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_instance_profile.sns-app-backend_for_ssm
  * aws_iam_role.sns-app-backend_for_ssm
  * aws_iam_role_policy_attachment.backend_for_ssm_for_ssm_attachment0
  * aws_instance.na2na-sns-app-backend
  * aws_internet_gateway.na2na-sns-app-backend
  * aws_route.na2na-sns-app-backend
  * aws_route_table.public
  * aws_route_table_association.na2na-sns-app-backend
  * aws_security_group.na2na-sns-app-backend
  * aws_security_group_rule.out_all
  * aws_subnet.public
  * aws_vpc.na2na-sns-app-backend


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_instance_profile.sns-app-backend_for_ssm will be created
  + resource "aws_iam_instance_profile" "sns-app-backend_for_ssm" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "sns-app-backend_for_ssm"
      + path        = "/"
      + role        = "NA2NASNSAPPBackendForSSM"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.sns-app-backend_for_ssm will be created
  + resource "aws_iam_role" "sns-app-backend_for_ssm" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "NA2NASNSAPPBackendForSSM"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.backend_for_ssm_for_ssm_attachment0 will be created
  + resource "aws_iam_role_policy_attachment" "backend_for_ssm_for_ssm_attachment0" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "NA2NASNSAPPBackendForSSM"
    }

  # aws_instance.na2na-sns-app-backend will be created
  + resource "aws_instance" "na2na-sns-app-backend" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "sns-app-backend_for_ssm"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "na2na-sns-app-backend"
        }
      + tags_all                             = {
          + "Name" = "na2na-sns-app-backend"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "df964276e2d6c12438ce854b461ffd0a9fbfc033"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.na2na-sns-app-backend will be created
  + resource "aws_internet_gateway" "na2na-sns-app-backend" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "na2na-sns-app-backend"
        }
      + tags_all = {
          + "Name" = "na2na-sns-app-backend"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.na2na-sns-app-backend will be created
  + resource "aws_route" "na2na-sns-app-backend" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "public_na2na-sns-app-backend"
        }
      + tags_all         = {
          + "Name" = "public_na2na-sns-app-backend"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.na2na-sns-app-backend will be created
  + resource "aws_route_table_association" "na2na-sns-app-backend" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.na2na-sns-app-backend will be created
  + resource "aws_security_group" "na2na-sns-app-backend" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "na2na-sns-app-backend"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "na2na-sns-app-backend"
        }
      + tags_all               = {
          + "Name" = "na2na-sns-app-backend"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.out_all will be created
  + resource "aws_security_group_rule" "out_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "na2na-sns-app-backend"
        }
      + tags_all                                       = {
          + "Name" = "na2na-sns-app-backend"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.na2na-sns-app-backend will be created
  + resource "aws_vpc" "na2na-sns-app-backend" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "na2na-sns-app-backend"
        }
      + tags_all                             = {
          + "Name" = "na2na-sns-app-backend"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"EC2-Plan","PRNumber":131,"Program":"tfcmt","SHA1":"2bb12fd047d885fa80b5382caea6a3dbe2ef3b8d","Vars":{},"WorkflowName":"Terraform Plan"} -->